/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "再试一次";
CancelButtonTitle = "取消";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION> 因为无法读取以下文件：“/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”。";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION> 因为找不到以下文件：“/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”。";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "如果移动或删除了“HPEventStore.hpstore”文件，请替换该文件，然后单击“再试一次”。\r要创建一个新文件，请单击“创建”。";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "创建";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION> 因为应用程序无法访问以下文件：“/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”。";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "修复访问权限";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "检查“HPEventStore.hpstore”的上层文件夹，以确保它们未被锁定，并将它们的权限设置为“读写”，然后单击“再试一次”。\r要让应用程序尝试修复权限，请单击“修复访问权限”。";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION> 因为启动磁盘中没有足够的空间。";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "从磁盘中删除一些文件，然后单击“再试一次”。";
